const colorRoles = {
    "أحمر": "1362848070735364296",
    "أزرق": "1362848144555118642",
    "أصفر": "1362848163068772493",
    "أخضر": "1362848187592872127",
    "برتقالي": "1362848255859363982",
    "وردي": "1362848213115338882",
    "بنفسجي": "1362848234862547005",
    "فيروزي": "1362848285618077898",
    "سماوي": "1362848315560951988",
    "كحلي": "1362848334942961896",
    "أبيض": "1362848353632911460",
    "أسود": "1362848371408109608",
    "رصاصي غامق": "1362848392027574392",
    "رصاصي فاتح": "1362848411430420911",
    "كريمي": "1362848457576157194",
    "رملي": "1362848474080481393",
    "وردي فاتح": "1362848493529731132",
    "بنفسجي فاتح": "1362848520192921620",
    "أزرق غامق": "1362848539570475038",
    "أخضر غامق": "1362848559397081319",
    "أحمر داكن": "1362848581089890384",
    "أزرق فاتح": "1362848598542389418",
    "بني": "1362848637197221968",
    "أخضر زيتوني": "1362848662664773833",
    "أصفر غامق": "1362848682571071499",
    "أخضر نعناعي": "1362848711150932218",
    "أزرق ثلجي": "1362848727240540180",
    "بنفسجي وردي": "1362848743241547866",
    "نحاسي": "1362848761595957461",
    "أخضر باهت": "1362848779346251987",
    "موف باهت": "1362848795339001866",
    "أزرق جليدي": "1362848859583283400",
    "نحاسي فاتح": "1362848903208239414",
    "فضي": "1362848927111708772",
    "كراميل": "1362848954139545662",
    "خوخي": "1362848973534138428",
    "أرجواني": "1362848997223436338",
    "أحمر نبيذي": "1362849016563372304",
    "زيتوني فاتح": "1362849033244246247",
    "بنفسجي ليلكي": "1362849051313438800",
    "أزرق ملكي": "1362849098021077092",
    "وردي خوخي": "1362849118158061869",
    "طيني فاتح": "1362849138252709948",
    "خمري": "1362849161128448041",
    "عنابي": "1362849182519394475",
    "سكري": "1362849205282017341"
  };
  
  async function execute(interaction) {
    if (!interaction.isStringSelectMenu()) return;
    if (interaction.customId !== 'select_color_1' && interaction.customId !== 'select_color_2') return;

  
    const selectedColor = interaction.values[0];
    const roleId = colorRoles[selectedColor];
    if (!roleId) return interaction.reply({ content: '❌ اللون غير موجود.', ephemeral: true });
  
    const member = interaction.member;
  
    // إزالة كل رولات الألوان
    const colorRoleIds = Object.values(colorRoles);
    await member.roles.remove(colorRoleIds).catch(() => { });
  
    // إضافة الرول الجديد
    await member.roles.add(roleId).catch(() => { });
  
    // الرد المؤقت
    const reply = await interaction.reply({
      content: `✅ تم تعيين اللون: ${selectedColor}`,
      ephemeral: false
    });
  
    setTimeout(() => {
      interaction.deleteReply().catch(() => { });
    }, 5000);
  }
  
  module.exports = {
    execute,
    colorRoles
  };
  